JMeter Tests/Test 4 - Upload Stress Test/upload_report/statistics.json
{
  "POST - Upload Binary Document (/api/inquiries/:id/documents)" : {
    "transaction" : "POST - Upload Binary Document (/api/inquiries/:id/documents)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6252.530000000002,
    "medianResTime" : 6167.5,
    "minResTime" : 2954.0,
    "maxResTime" : 10813.0,
    "pct1ResTime" : 8476.5,
    "pct2ResTime" : 8800.599999999999,
    "pct3ResTime" : 10804.579999999996,
    "throughput" : 1.60521373420871,
    "receivedKBytesPerSec" : 2.0080847592982005,
    "sentKBytesPerSec" : 3289.1637350614797
  },
  "POST - Create Parent Inquiry (/api/inquiries)" : {
    "transaction" : "POST - Create Parent Inquiry (/api/inquiries)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1523.760000000001,
    "medianResTime" : 1289.0,
    "minResTime" : 486.0,
    "maxResTime" : 4468.0,
    "pct1ResTime" : 2871.2000000000003,
    "pct2ResTime" : 4042.0999999999945,
    "pct3ResTime" : 4465.729999999999,
    "throughput" : 1.700767045937718,
    "receivedKBytesPerSec" : 1.2755752844532886,
    "sentKBytesPerSec" : 1.4134304258720685
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 225,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3723.4977777777785,
    "medianResTime" : 2984.0,
    "minResTime" : 486.0,
    "maxResTime" : 10813.0,
    "pct1ResTime" : 7601.400000000001,
    "pct2ResTime" : 8383.499999999998,
    "pct3ResTime" : 9922.640000000001,
    "throughput" : 3.3401125246797205,
    "receivedKBytesPerSec" : 3.4513771237548805,
    "sentKBytesPerSec" : 3043.152079266437
  },
  "POST - Login (/api/users/login)" : {
    "transaction" : "POST - Login (/api/users/login)",
    "sampleCount" : 25,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2406.32,
    "medianResTime" : 2418.0,
    "minResTime" : 962.0,
    "maxResTime" : 3794.0,
    "pct1ResTime" : 3545.4,
    "pct2ResTime" : 3742.1,
    "pct3ResTime" : 3794.0,
    "throughput" : 0.787178437608237,
    "receivedKBytesPerSec" : 1.0201033073302057,
    "sentKBytesPerSec" : 0.2429183459806669
  }
}